# -*- coding: utf-8 -*-
import pypdfplot as plt
from plot_script import *

plt.pack('plot_script.py',True)
#plt.publish()
plt.show()

 ### -+- Don't remove this line -+- ###
 ###  |    Date:    2018-06-10   |  ###
 ###  |    Time:         20:37   |  ###
 ###  |    Revision:         1   |  ###
 ### -+--------------------------+- ###

"""
%PDF-1.4
%0000000033 0000000001 0000000128
%plot_script.py|0|132|1365429079
%S'import pypdfplot as plt\nimport numpy as np\n\nx = np.arange(-10,10,0.1)\ny = x**2\n\nplt.plot(x,y)\n##plt.show()\n##\n##'
%p0
%.%ﾬÜ ﾫﾺ
1 0 obj
<< /Type /Catalog /Pages 2 0 R >>
endobj
8 0 obj
<< /XObject 7 0 R /Pattern 5 0 R
/ProcSet [ /PDF /Text /ImageB /ImageC /ImageI ] /ExtGState 4 0 R
/Shading 6 0 R /Font 3 0 R >>
endobj
10 0 obj
<< /Group << /CS /DeviceRGB /S /Transparency /Type /Group >> /Parent 2 0 R
/MediaBox [ 0 0 576 432 ] /Resources 8 0 R /Type /Page /Contents 9 0 R >>
endobj
9 0 obj
<< /Filter /FlateDecode /Length 11 0 R >>
stream
xﾜﾥVËnEÝ÷Wô)w=úﾵﾌDbgﾰ`ﾍ ,;ȉﾐﾟSÝ3wúb_	YÖígﾝﾪSﾧﾪﾇã]àø{LñÿOﾑ㻐0zﾈﾹüޏ_SÁ(m﾿ﾄáê-n}ÆһPë$~ﾅٜÜomﾍf8ﾴýúcÜoﾙ?fﾙJüô>þ?ƫﾷâﾶ%~wîðÿÝ%ﾎ?ﾰiç!ÖFﾥﾗﾨﾥﾑ֜ﾦ[&í8aﾍr.XêBﾩﾵﾨұÅ:ﾖÕfA9QS)~ﾑS&kQpﾺu?Ã,Ĉ\jﾦÜØÆ!DÔàﾀdüﾶq.ﾰ`﾿àﾦá&ﾷ<ﾛﾩð,ɸﾫﾍpA`6Oc1ﾎ3ﾼQíðkYHﾳDnF5×:ﾌåN	ﾮqeﾪ}[+ﾙ*ﾬøﾞeÜõﾵ*dØêØòﾅN/þﾴyﾂrd)ﾈnóﾶ'ﾸÆÜáﾚ:ﾏﾁ;ð%%ﾞÖ{'ﾁ	Nﾕ8M:$)Pﾋ9äAﾭﾤFﾈ"v8X\9÷ÁC.H`2Oﾶﾅ+ﾒâÙÚn	Vﾚ'$@ﾁﾇ	g*ÔÁ#ﾓA4ﾑﾁþ:ØY5ê0áè6B'ﾱؐﾚ@b
ﾐﾅﾑ]÷Vﾠ
ﾕﾑCﾳ4ﾭﾀö
ÙddﾤﾞKﾕôd'ﾠNﾏ`è9Qﾟqﾕ2È1ÏOﾚqÕDﾹBﾴñHﾕëZﾊÈvï}FﾋČﾢﾂﾏ]m8ﾅﾄﾃxﾬlﾆ qW4ÜÏÌCÚ.ÍﾡyѠZﾆﾡ^É+òX
ﾊ\ﾸ0ﾗﾋﾚ
i9lً-ðXÊÈÅIGﾇe
EÅÈ3ﾱ"!ﾁ'Q|ÁäA[PﾭTﾐȅ\Eﾭ$ﾧòHﾁﾢﾸﾎDEͼﾧQqيﾅ%Í
éwﾤqﾃâﾴWÿ!ﾙÑ\勰ﾴ*òNÚÓZﾽﾬòÔﾣHã!b,ﾪHãﾪuﾴoaﾭ	ÅØ8
ÇR"ÏÃR]XﾳÑ3ﾖ*RW&L=ﾍüÒR##ﾛàwiﾂ2÷BtJÚl%ﾆÞ澕ꅆ>bﾊ2ﾌﾸAÁÊ@zöS]Ñ tD`H%*UëM#
Êﾆ{ﾲ ⽨OﾇJﾕûcÖGÃdÙÊRuéﾠ5bﾯ[ﾛﾖ@#účjϓ3khÃ ﾷﾜõéY/Þ
TﾔfFﾳ"otﾮN}TH?^üêUﾘfÂ3ﾃ?ðﾁBﾒ/ﾬﾅÃM|<UﾞöﾗkLÎ^+ÜXﾞﾲçﾛ/﾿xgÇ{ﾇå
::áﾭõG
jﾋOççQjnåúìﾍóá(ﾬofà}xģﾝâKò<áﾩ(ﾫ}׷ñê;ﾆÀâíèô[iØJñöﾷðﾧﾯãí]øöfﾰﾇSþﾼ#ﾸúéýﾧ_Þ<üùñïÏñﾛ﾿Â
þö ﾆãÜÐûw߷Éîþﾜîìﾳ׃à:T7ﾜüﾯaäÿ*ﾙNØ&{sﾺGﾱÏ^ﾈâÌIïÒè	ﾹÈ)wuáê<ﾚ(ﾵ~ﾛìðsﾺÃïﾳ/Áﾞä^pú>﾿ÿﾂÄOðﾫâý	OúÎ3x~9üEüe/ﾡë{eGy]ÆEO@OfGíø2{ﾕtﾠúﾷﾝnﾸÛø@>mNìeÿbÔþ쌘ٛøﾵ\ÆGoBSﾛøsﾼàïﾛþﾱÿ
>ﾀﾽà1ÁCﾰáÛE|Á{ﾍÆ8ðﾷñﾁڜøËþkñÏ$ﾮÛðËE|ÿﾶ(mâoãEsûæÄ_ö_×6ﾲÏþﾩﾳáﾷËø{s-ﾧý\ñﾶtüW
ﾮúﾇﾐﾛ?Ç'ﾽﾟﾠoÂ?4`ﾷb
endstream
endobj
11 0 obj
1262
endobj
16 0 obj
<< /Filter /FlateDecode /Length 317 >>
stream
xﾜ5RKrC1ۿSpﾁΘ﾿}ﾞtﾲjﾄ'+ﾰ-@B./YÒK~Ô%ۥÃäW÷%ﾱB>ﾏíﾚÌRÅ÷ﾳÏ-ﾯGÏﾷ-
Q=ø2'"ÔÏÔè:xaﾗ>ﾯN)xﾓ
